# Deadlock Code
import threading
import time

# بنعرف القفلين (Resources) اللي الخناقة هتحصل عليهم
# تخيلهم قلمين، وكل واحد محتاج القلمين عشان يكتب
resource_1 = threading.Lock()
resource_2 = threading.Lock()


def thread_1():
    # 1. الـ Thread ده هيمسك المورد الأول ويقفل عليه
    with resource_1:
        print("Thread 1: أنا مسكت resource_1 خلاص 🔒")

        # بنعمل sleep عشان ندي فرصة لـ thread_2 يلحق يشتغل ويمسك المورد بتاعه
        # دي اللحظة اللي بتضمن حدوث المشكلة
        time.sleep(1)

        print("Thread 1: أنا دلوقتي مستني resource_2 يفضى عشان أخده... ⏳")

        # 2. اللحظة الحاسمة (Nested Lock):
        # هو "لسه ماسك" المورد الأول (لأننا لسه جوه الـ with الأولى)
        # وبيحاول ياخد المورد التاني.. بس التاني مشغول مع Thread 2
        # فهيفضل واقف هنا للأبد ومش هيتحرك
    with resource_2:
            print("Thread 1: أخيييراً مسكت resource_2 (الجملة دي مش هتتطبع أبداً 💀)")


def thread_2():
    # 1. الـ Thread التاني بدأ ومسك المورد التاني وقفل عليه (عكس الأولاني)
    with resource_2:
        print("Thread 2: أنا مسكت resource_2 خلاص 🔒")

        # نام ثانية هو كمان
        time.sleep(1)

        print("Thread 2: أنا دلوقتي مستني resource_1 يفضى عشان أخده... ⏳")

        # 2. بيحاول ياخد الأول وهو لسه ماسك التاني
        # هيلاقي الأول مشغول مع Thread 1.. فيقف يستنى
        # النتيجة: ده مستني ده، وده مستني ده.. والاتنين عطلانين
    with resource_1:
         print("Thread 2: أخيييراً مسكت resource_1 (الجملة دي مش هتتطبع أبداً 💀)")


# تجهيز الـ Threads
a = threading.Thread(target=thread_1, name="thread1")
b = threading.Thread(target=thread_2, name="thread2")


# تشغيل الـ Threads
a.start()
b.start()

# ملحوظة: البرنامج هيفضل شغال ومش هيقفل (Terminated) غير لما توقفه أنت
